<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<script>

//상품별 로딩BG 이미지 하얀색으로 초기화
function fn_cleanBG(objID) {
	try {
		/*
		var obj = $("#"+objID);
		var objA = $("#A"+objID+"A");
		objA.css({background:"url(whiteloading.gif) no-repeat"});
		*/
	}catch(e){
		//혹시 에러나면 걍 무시
	}
}

// 사이즈를 선택하지 않고 수량을 선택할 경우
function checkSize(){
    if ($("#itemNo").val() == ""){
        $("#sizeAlertLine").show();
        $("#sizeAlert").show();
        return;
    }
    renderQuantity();
}

	//카탈리스트 사이즈 선택기
	function fn_catalystSizeList() {
		$pdp = $(".Pdp");
		var size_arr = null;
		var var51 = "";
		/*
		for (var i = 0; i < global_item.size.a.length; i++) {
			size_arr = global_item.size.a[i].split("*|*");
			var stockYn = 'n';
			if (size_arr[4] > 0)
				stockYn = 'y';
			var51 += size_arr[0] + ":" + stockYn;
			if (var51.length > 0 && i < global_item.size.a.length - 1)
				var51 += '|';
		}
		*/
		s.linkTrackVars = 'prop45,eVar51,products';
		s.prop45 = "size run:" + $("#prop20").val() + ":open";
		s.eVar51 = var51;
		s.products = ';' + $("#prop20").val();
		s.tl(true, 'o', 'Size Run Selections');
	}

	//컬러선택
	$(function() {
		$('.layerStoreStock .select_color a.btn_option').on(
				"click",
				function() {
					$('#chooseSize').html(
							'<span class="default" >사이즈 선택</span>');
					if ($(this).hasClass('open')) {
						$(this).removeClass('open');
						$(this).next('.opt_list').stop().slideUp(200);
					} else if ($(this).hasClass('default')) {
						$(this).removeClass('open');
						$(this).next('.opt_list').stop().slideUp(200);
					} else {
						$('.layerStoreStock .selectarea a.btn_option')
								.removeClass('open');
						$('.layerStoreStock .select_size .opt_list').stop()
								.slideUp(200);
						$(this).addClass('open');
						$(this).next('.opt_list').stop().slideDown(200);
					}
					return false;
				});
	});

	// 사이즈 선택
	$(function() {
		$('.layerStoreStock .select_size a.btn_option').live(
				"click",
				function() {

					if ($("#colorDefault").text() == "컬러 선택") {
						alert("컬러를 먼저 선택해 주세요.");
						return;
					}
					var chooseSize = $.trim($('#chooseSize').val());
					/*
					
					var sizeList = '[02843384701  250||250||02843384701, 02843384701  255||255||02843384701, 02843384701  260||260||02843384701, 02843384701  265||265||02843384701, 02843384701  270||270||02843384701, 02843384701  275||275||02843384701, 02843384701  280||280||02843384701, 02843384001  245||245||02843384001, 02843384001  250||250||02843384001, 02843384001  255||255||02843384001, 02843384001  260||260||02843384001, 02843384001  265||265||02843384001, 02843384001  270||270||02843384001, 02843384001  275||275||02843384001, 02843384001  280||280||02843384001, 02843384001  285||285||02843384001, 02843384001  290||290||02843384001, 02843384001  295||295||02843384001, 02843384100  245||245||02843384100, 02843384100  250||250||02843384100, 02843384100  255||255||02843384100, 02843384100  260||260||02843384100, 02843384100  265||265||02843384100, 02843384100  270||270||02843384100, 02843384100  275||275||02843384100, 02843384100  280||280||02843384100, 02843384100  285||285||02843384100, 02843384100  295||295||02843384100, 02843384101  250||250||02843384101, 02843384101  255||255||02843384101, 02843384101  260||260||02843384101, 02843384101  265||265||02843384101, 02843384101  270||270||02843384101, 02843384101  275||275||02843384101, 02843384101  280||280||02843384101, 02843384101  285||285||02843384101, 02843384101  290||290||02843384101, 02843384301  250||250||02843384301, 02843384301  255||255||02843384301, 02843384301  260||260||02843384301, 02843384301  265||265||02843384301, 02843384301  270||270||02843384301, 02843384301  275||275||02843384301, 02843384301  280||280||02843384301, 02843384301  285||285||02843384301, 02843384401  250||250||02843384401, 02843384401  265||265||02843384401, 02843384401  270||270||02843384401, 02843384401  275||275||02843384401, 02843384401  280||280||02843384401, 02843384401  285||285||02843384401, 02843384401  290||290||02843384401, 02843384601  250||250||02843384601, 02843384601  255||255||02843384601, 02843384601  260||260||02843384601, 02843384601  265||265||02843384601, 02843384601  270||270||02843384601, 02843384601  275||275||02843384601, 02843384601  280||280||02843384601, 02843384601  285||285||02843384601, 02843384601  290||290||02843384601, 02843384601  295||295||02843384601, 02843384701  240||240||02843384701, 02843384701  245||245||02843384701, 02843384701  285||285||02843384701, 02843384701  290||290||02843384701, 02843384701  295||295||02843384701, 02843384701  300||300||02843384701, 02843384701  305||305||02843384701, 02843384701  310||310||02843384701, 02843384701  320||320||02843384701, 02843384701  330||330||02843384701, 02843384001  240||240||02843384001, 02843384001  300||300||02843384001, 02843384001  305||305||02843384001, 02843384001  310||310||02843384001, 02843384001  320||320||02843384001, 02843384001  330||330||02843384001, 02843384100  240||240||02843384100, 02843384100  290||290||02843384100, 02843384100  300||300||02843384100, 02843384100  305||305||02843384100, 02843384100  310||310||02843384100, 02843384100  320||320||02843384100, 02843384100  330||330||02843384100, 02843384101  240||240||02843384101, 02843384101  245||245||02843384101, 02843384101  295||295||02843384101, 02843384101  300||300||02843384101, 02843384101  305||305||02843384101, 02843384101  310||310||02843384101, 02843384101  320||320||02843384101, 02843384101  330||330||02843384101, 02843384301  240||240||02843384301, 02843384301  245||245||02843384301, 02843384301  290||290||02843384301, 02843384301  295||295||02843384301, 02843384301  300||300||02843384301, 02843384301  305||305||02843384301, 02843384301  310||310||02843384301, 02843384301  320||320||02843384301, 02843384301  330||330||02843384301, 02843384401  240||240||02843384401, 02843384401  245||245||02843384401, 02843384401  255||255||02843384401, 02843384401  260||260||02843384401, 02843384401  295||295||02843384401, 02843384401  300||300||02843384401, 02843384401  305||305||02843384401, 02843384401  310||310||02843384401, 02843384401  320||320||02843384401, 02843384401  330||330||02843384401, 02843384601  240||240||02843384601, 02843384601  245||245||02843384601, 02843384601  300||300||02843384601, 02843384601  305||305||02843384601, 02843384601  310||310||02843384601, 02843384601  320||320||02843384601, 02843384601  330||330||02843384601]';
					sizeList = sizeList.replace("[", "");
					sizeList = sizeList.replace("]", "");
					var searchList = sizeList.split(",");
					var list = "";
					var size = "";
					var html = "";
					html += "<ul>";

					for (var i = 0; i < searchList.length; i++) {
						list = searchList[i].split("||");
						if (list[2] == $("#corpItemCode").val()) {
							if ((chooseSize != null || chooseSize != "")
									&& chooseSize == list[1]) {
								html += '	<li><a href="#none" class="selected"  title="'+ list[0] +'" >'
										+ list[1] + '</a></li>';
							} else {
								html += '	<li><a href="#none" title="'+ list[0] +'" >'
										+ list[1] + '</a></li>';
							}
						}
					}
					html += "</ul>";
					$("#sizeValue1").html(html);

					 */
					$("#sizeValue1 ul li").on(
							"click",
							function() {
								$(".btn_option .default").text(
										$(this).find("a").text());
								$('#chooseSize').val($(this).find("a").text());
								$('#chooseStocksize').val(
										$(this).find("a").attr('title'));

							});

					if ($(this).hasClass('open')) {
						$(this).removeClass('open');
						$(this).next('.opt_list').stop().slideUp(200);
					} else if ($(this).hasClass('default')) {
						$(this).removeClass('open');
						$(this).next('.opt_list').stop().slideUp(200);
					} else {
						$('.layerStoreStock .selectarea a.btn_option')
								.removeClass('open');
						$('.layerStoreStock .select_color .opt_list').stop()
								.slideUp(200);
						$(this).addClass('open');
						$(this).next('.opt_list').stop().slideDown(200);
					}

					return false;
				});
	});

	//컬러 옵션 선택
	$(function() {
		$('.layerStoreStock .select_color .opt_list a').on(
				"click",
				function() {
					var optvalue = $(this).html();

					$(this).closest('.selectarea').find('a.btn_option')
							.removeClass('open');
					$(this).closest('.selectarea').find('a.btn_option').html(
							optvalue);
					$(this).closest('.selectarea').find('.opt_list a')
							.removeClass('selected');
					$(this).addClass('selected');
					$(this).closest('.opt_list').stop().slideUp(100);
					return false;
				});
	});

	//사이즈 옵션 선택
	$(function() {
		$("#sizeValue1").on(
				"click",
				function() {
					$(this).closest('.selectarea').find('a.btn_option')
							.removeClass('open');
					$(this).closest('.selectarea').find('.opt_list a')
							.removeClass('selected');
					$(this).addClass('selected');
					$(this).closest('.opt_list').stop().slideUp(100);

					return false;
				});
	});
</script>
